package com.gsy.ml.prestener.common;

/**
 * *                            _ooOoo_
 * *                           o8888888o
 * *                           88" . "88
 * *                           (| -_- |)
 * *                            O\ = /O
 * *                        ____/`---'\____
 * *                      .   ' \\| |// `.
 * *                       / \\||| : |||// \
 * *                     / _||||| -:- |||||- \
 * *                       | | \\\ - /// | |
 * *                     | \_| ''\---/'' | |
 * *                      \ .-\__ `-` ___/-. /
 * *                   ___`. .' /--.--\ `. . __
 * *                ."" '< `.___\_<|>_/___.' >'"".
 * *               | | : `- \`.;`\ _ /`;.`/ - ` : | |
 * *                 \ \ `-. \_ __\ /__ _/ .-` / /
 * *         ======`-.____`-.___\_____/___.-`____.-'======
 * *                            `=---='
 * *         .............................................
 * *
 * *                 佛祖保佑             永无BUG
 * *          佛曰:
 * *                  别人笑我太疯癫，我笑他人看不穿。
 *
 * @author
 * @date 16/3/1
 * 基本P与V通讯的数据加载监听
 */
public interface ILoadPVListener {
    void onLoadComplete(Object object, int... parms);

    void onLoadComplete(Object object, Class itemClass);
}
